doc/nncss.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>NNCSS</title>
<!-- 2015-04-26 Sun 17:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">NNCSS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. About literate programming</a></li>
<li><a href="#sec-2">2. Content width</a></li>
<li><a href="#sec-3">3. Headers</a></li>
<li><a href="#sec-4">4. Paragraphs</a></li>
<li><a href="#sec-5">5. Tables</a></li>
<li><a href="#sec-6">6. Images</a></li>
<li><a href="#sec-7">7. Final CSS</a></li>
</ul>
</div>
</div>
<p>
What is NNCSS?
</p>

<p>
NNCSS uses literate programming, a technique where code is weaved into the body
of human-readable text.  This document therefore represents both the
documentation and the code for NNCSS.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About literate programming</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Content width</h2>
<div class="outline-text-2" id="text-2">
<p>
The width of A4 paper is 210 mm.  Based on this measure, I decided to make the
content width for NNCSS 190mm.
</p>

<div class="org-src-container">

<pre class="src src-css" id="width-and-center">margin: 0 auto;
max-width: 190mm;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Headers</h2>
<div class="outline-text-2" id="text-3">
<p>
We apply a standard formatting to all header elements.  We use our general
width and centering code from above, as well as setting shared top and bottom
margin sizes.
</p>

<div class="org-src-container">

<pre class="src src-css">h1, h2, h3, h4, h5, h6 {
    margin: 0 auto;
    max-width: 190mm;
    margin-top: 7mm;
    margin-bottom: 4mm;
}
</pre>
</div>

<p>
We also provide some special formatting for <code>&lt;h1&gt;</code>, which is reserved for the
title.
</p>

<div class="org-src-container">

<pre class="src src-css">h1 {
    text-align: center;
    margin-top: 15mm;
    margin-bottom: 7mm;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Paragraphs</h2>
<div class="outline-text-2" id="text-4">
<p>
Our styling for paragraphs uses the shared width and centering (I'll stop
mentioning this later, everything will be using this shared styling).  In
addition, use justification to make paragraphs look neat and add a bottom
margin for spacing purposes.
</p>

<div class="org-src-container">

<pre class="src src-css">p {
    margin: 0 auto;
    max-width: 190mm;
    text-align: justify;
    margin-bottom: 4mm;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Tables</h2>
<div class="outline-text-2" id="text-5">
<p>
We apply some general formatting for the <code>&lt;table&gt;</code> element.  Of note is
collapsing the borders.  If we did not do that, the borders for the table rows
below would not appear.
</p>

<div class="org-src-container">

<pre class="src src-css">table {
    margin: 0 auto;
    max-width: 190mm;
    margin-top: 7mm;
    margin-bottom: 7mm;
    border-collapse: collapse;
}
</pre>
</div>

<p>
I believe that lines separating the rows of a table are essential.  Vertical
lines are less important, although I may add a mechanism for these in the
future, as used sparingly vertical lines may be helpful in some circumstances.
</p>

<div class="org-src-container">

<pre class="src src-css">tr {
    border-top: 1px black solid;
    border-bottom: 1px black solid;
}
</pre>
</div>

<p>
We add some padding for table cells to make it look nice.
</p>

<div class="org-src-container">

<pre class="src src-css">th, td {
    padding: 2mm;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Images</h2>
<div class="outline-text-2" id="text-6">
<p>
Images in HTML are considered inline block elements.  This is stupid, because
there is no good reason for an image to be formatted inline in a document
(that is, any page that presents content and not web design vomit).
</p>

<p>
We fix this.
</p>

<p>
We also add spacing around images so they don't creep out the other HTML
elements.
</p>

<div class="org-src-container">

<pre class="src src-css">img {
    margin: 0 auto;
    max-width: 190mm;
    display: block;
    margin-top: 7mm;
    margin-bottom: 7mm;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Final CSS</h2>
<div class="outline-text-2" id="text-7">
<p>
Our final CSS code:
</p>

<div class="org-src-container">

<pre class="src src-css">h1, h2, h3, h4, h5, h6 {
    margin: 0 auto;
    max-width: 190mm;
    margin-top: 7mm;
    margin-bottom: 4mm;
}

h1 {
    text-align: center;
    margin-top: 15mm;
    margin-bottom: 7mm;
}

p {
    margin: 0 auto;
    max-width: 190mm;
    text-align: justify;
    margin-bottom: 4mm;
}

table {
    margin: 0 auto;
    max-width: 190mm;
    margin-top: 7mm;
    margin-bottom: 7mm;
    border-collapse: collapse;
}

tr {
    border-top: 1px black solid;
    border-bottom: 1px black solid;
}

th, td {
    padding: 2mm;
}

img {
    margin: 0 auto;
    max-width: 190mm;
    display: block;
    margin-top: 7mm;
    margin-bottom: 7mm;
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-04-26 Sun 17:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
